## Segment 3 - Removing duplicates

In [1]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

### Removing duplicates

In [3]:
DF_obj= DataFrame({'column 1':[1,1,2,2,3,3,3],
                   'column 2':['a', 'a','b', 'b', 'c', 'c', 'c'],
                   'column 3':['A', 'A', 'B', 'B', 'C', 'C', 'C']})
DF_obj

   column 1 column 2 column 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        C
6         3        c        C

In [4]:
DF_obj.duplicated()

0    False
1     True
2    False
3     True
4    False
5     True
6     True
dtype: bool

In [5]:
DF_obj.drop_duplicates()

   column 1 column 2 column 3
0         1        a        A
2         2        b        B
4         3        c        C

In [6]:
DF_obj= DataFrame({'column 1':[1,1,2,2,3,3,3],
                   'column 2':['a', 'a','b', 'b', 'c', 'c', 'c'],
                   'column 3':['A', 'A', 'B', 'B', 'C', 'D', 'C']})
DF_obj

   column 1 column 2 column 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        D
6         3        c        C

In [7]:
DF_obj.duplicated()

0    False
1     True
2    False
3     True
4    False
5    False
6     True
dtype: bool

In [8]:
df1= DF_obj.drop_duplicates(['column 3'])

In [9]:
df1

   column 1 column 2 column 3
0         1        a        A
2         2        b        B
4         3        c        C
5         3        c        D

# Class Exercise:Detect and Remove Duplicate Students in a Dataset

Use Pandas to read the following data into a DataFrame and remove any duplicate student entries. Assume you are considered a duplicate if both the name and age are the same.

Create the dataframe using below information:

name,age,grade

Sophia,19,A

Jackson,20,B

Sophia,19,A

Olivia,18,A

Jackson,20,B



### Steps:

Load the dataset into a Pandas DataFrame.

Print the duplicate rows.

Remove the duplicates and print the cleaned dataset.



## Bonus Task:Find the Most Frequent Element

Write a function called most_frequent that takes a list of elements and returns the element that appears the most times.

take one list as mention below for test purpose

elements = ['apple', 'banana', 'apple', 'orange', 'banana', 'apple']

In [11]:
data = [{'name':'Sophia', 'age':19, 'grade':'A'},
        {'name':'Jackson', 'age':20, 'grade':'B'},
        {'name':'Sophia', 'age':19, 'grade':'A'},
        {'name':'Olivia', 'age':18, 'grade':'A'},
        {'name':'Jackson', 'age':20, 'grade':'B'}]

df = pd.DataFrame(data)
df

      name  age grade
0   Sophia   19     A
1  Jackson   20     B
2   Sophia   19     A
3   Olivia   18     A
4  Jackson   20     B

In [12]:
df.duplicated()

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [14]:
df.drop_duplicates()

      name  age grade
0   Sophia   19     A
1  Jackson   20     B
3   Olivia   18     A

In [31]:
def most_frequent(fruits):
    df_fruits = pd.DataFrame(fruits, columns=['element'])
    print(df_fruits.value_counts())

fruits = ['apple', 'banana', 'apple', 'orange', 'banana', 'apple']
most_frequent(fruits)

element
apple      3
banana     2
orange     1
Name: count, dtype: int64